IDEA Open Model
ReinfBarOnEdge Properties
Compatible with IDEA StatiCa v 10.1
The ReinfBarOnEdge type exposes the following members.
Properties
Name | Description
AnchorLength
 Anchor length of main bars, if MasterComponent is opening
BarDistance
 Vector determining direction of reinforcement layers, vector is defined in local coordinates of first segment
Cover
 Cover of reinforcement
 (Inherited from ReinforcementGroup.)
CoverFromSetting
 Use cover from DetailModelSetting
 (Inherited from ReinforcementGroup.)
Diameter
 Diameter o reinforcement
 (Inherited from ReinforcementGroup.)
DiameterOfMandrel
 Diameter of mandrel - multiplier of bar diameter to obtain inner diameter of bent reinforcement bars
 (Inherited from ReinforcementGroup.)
Distance
 Distance between reinforcement layers
EdgePositionType
 Position of reinforcement on edge
EndsTypeBeg
 End type of the beginning of reinforcement bar
 (Inherited from ReinforcementGroup.)
EndsTypeEnd
 End type of the end of reinforcement bar
 (Inherited from ReinforcementGroup.)
ExtendDistanceBegin
 Distance of extension of beginning
ExtendDistanceEnd
 Distance of extension of end
ExtendTypeBegin
 type of extension of beginning of bar
ExtendTypeEnd
 type of extension of end of bar
Id
 Element Id
 (Inherited from OpenElementId.)
Length
 length of bar
MasterComponent
 Master component of reinforcement
MasterEdge
 Master edge on Outline of MasterComponent
Material
 Material
 (Inherited from Reinforcement.)
NumOfBarsInLayer
 Number of bars in layer
 (Inherited from ReinforcementGroup.)
NumOfLayers
 Number of layers
PositionOnEdge
 Position of beginning of bar from start or end of edge
ReinfId
 Id representing reinforcement in Detail
 (Inherited from Reinforcement.)
Top
See Also
Reference
ReinfBarOnEdge Class
IdeaRS.OpenModel.Detail Namespace